CSI API ETABS v1

# cDStAISC_LRFD93 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDStAISC_LRFD93

    Public Interface cDStAISC_LRFD93

    Dim instance As cDStAISC_LRFD93

    public interface class cDStAISC_LRFD93

    type cDStAISC_LRFD93 =  interface end

The cDStAISC_LRFD93 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|
|
GetPreference|
|
SetOverwrite|
|
SetPreference|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com